# Preprocessing Timeseries Data

**Pandas** contains extensive capabilities and features for working with time series data for all domains. Using the NumPy datetime64 and timedelta64 dtypes, pandas has consolidated a large number of featurs from other python libraries like scikits.timeseries as well as created a tremendous amount of new functionality for manipulating time series data.

In [1]:
# importing the pandas library and datetime module of python standard library
import pandas as pd
import datetime

In [2]:
# read the data set
data = pd.read_csv('datasets/time_series.csv')

In [3]:
# view the top rows 
data.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

### Data Types of columns

In [4]:
data .dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

**By Default: All datetime based columns are considered as strings.**

### CHANGE THE DATA TYPE TO DATETIME

In [5]:
# change type to datetime 
data.Datetime = pd.to_datetime(data.Datetime)

In [6]:
# check the data types again 
data.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [7]:
data

          ID            Datetime  Count
0          0 2012-08-25 00:00:00      8
1          1 2012-08-25 01:00:00      2
2          2 2012-08-25 02:00:00      6
3          3 2012-08-25 03:00:00      2
4          4 2012-08-25 04:00:00      2
...      ...                 ...    ...
18283  18283 2014-09-25 19:00:00    868
18284  18284 2014-09-25 20:00:00    732
18285  18285 2014-09-25 21:00:00    702
18286  18286 2014-09-25 22:00:00    580
18287  18287 2014-09-25 23:00:00    534

[18288 rows x 3 columns]

In [9]:
data.Datetime.apply(lambda x : x.day_name())

0        Saturday
1        Saturday
2        Saturday
3        Saturday
4        Saturday
           ...
18283    Thursday
18284    Thursday
18285    Thursday
18286    Thursday
18287    Thursday
Name: Datetime, Length: 18288, dtype: object

In [10]:
data.Datetime.apply(lambda x : x.month_name())

0           August
1           August
2           August
3           August
4           August
           ...
18283    September
18284    September
18285    September
18286    September
18287    September
Name: Datetime, Length: 18288, dtype: object

## Let's see another data file with the time series data

In [27]:
data_2 = pd.read_csv('datasets/time_series_2.csv')

In [28]:
# view the top rows of the data
#data_2.head()
data_2

          ID      Datetime  Count
0          0  25 Aug 2012       8
1          1  25 Aug 2012       2
2          2  25 Aug 2012       6
3          3  25 Aug 2012       2
4          4  25 Aug 2012       2
...      ...           ...    ...
18283  18283  25 Sep 2014     868
18284  18284  25 Sep 2014     732
18285  18285  25 Sep 2014     702
18286  18286  25 Sep 2014     580
18287  18287  25 Sep 2014     534

[18288 rows x 3 columns]

## We can read the date time by specifying the format.

## Here are some of the common used directives.

| **Directive** | **Meaning**                                            |
| ---           | ---                                                    |
|  **%a**       | Weekday as locale’s abbreviated name.                  |
|  **%A**       | Weekday as locale’s full name.                         |  
|  **%d**       | Day of the month as a zero-padded decimal number.      |
|  **%b**       | Month as locale’s abbreviated name.	                 |
|  **%B**       | Month as locale’s full name.	                         |
|  **%m**       | Month as a zero-padded decimal number.                 |
|  **%y**       | Year without century as a zero-padded decimal number.  |
|  **%Y**       | Year with century as a decimal number.                 |
|  **%H**       | Hour (24-hour clock) as a zero-padded decimal number.  |

---

***You can read more about the other directives and datetime library here: https://docs.python.org/3/library/datetime.html***

In [30]:
# convert the datetime by specifying the date time format
data_2.Datetime = pd.to_datetime(data_2.Datetime, format="%d %b %Y ")

In [31]:
data_2.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [33]:
data_2.head()

   ID   Datetime  Count
0   0 2012-08-25      8
1   1 2012-08-25      2
2   2 2012-08-25      6
3   3 2012-08-25      2
4   4 2012-08-25      2

## TIME BASED FEATURES

## Create features like month and month_name from the data.

In [34]:
data

          ID            Datetime  Count
0          0 2012-08-25 00:00:00      8
1          1 2012-08-25 01:00:00      2
2          2 2012-08-25 02:00:00      6
3          3 2012-08-25 03:00:00      2
4          4 2012-08-25 04:00:00      2
...      ...                 ...    ...
18283  18283 2014-09-25 19:00:00    868
18284  18284 2014-09-25 20:00:00    732
18285  18285 2014-09-25 21:00:00    702
18286  18286 2014-09-25 22:00:00    580
18287  18287 2014-09-25 23:00:00    534

[18288 rows x 3 columns]

In [35]:
# create month and month_name
data['month'] = data.Datetime.dt.month
data['month_name'] = data.Datetime.dt.month_name()

In [37]:
# view the data
data

          ID            Datetime  Count  month month_name
0          0 2012-08-25 00:00:00      8      8     August
1          1 2012-08-25 01:00:00      2      8     August
2          2 2012-08-25 02:00:00      6      8     August
3          3 2012-08-25 03:00:00      2      8     August
4          4 2012-08-25 04:00:00      2      8     August
...      ...                 ...    ...    ...        ...
18283  18283 2014-09-25 19:00:00    868      9  September
18284  18284 2014-09-25 20:00:00    732      9  September
18285  18285 2014-09-25 21:00:00    702      9  September
18286  18286 2014-09-25 22:00:00    580      9  September
18287  18287 2014-09-25 23:00:00    534      9  September

[18288 rows x 5 columns]

## Create day_name, day_of_week & day_of_year

In [39]:
# create features
data['day_name'] = data.Datetime.dt.day_name()
data['day_of_week'] = data.Datetime.dt.day_of_week
data['day_of_year'] = data.Datetime.dt.day_of_year

In [41]:
# view the data
data

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238
...,...,...,...,...,...,...,...,...
18283,18283,2014-09-25 19:00:00,868,9,September,Thursday,3,268
18284,18284,2014-09-25 20:00:00,732,9,September,Thursday,3,268
18285,18285,2014-09-25 21:00:00,702,9,September,Thursday,3,268
18286,18286,2014-09-25 22:00:00,580,9,September,Thursday,3,268
18287,18287,2014-09-25 23:00:00,534,9,September,Thursday,3,268

## DIFFERENCE BETWEEN TO DATES

**Add the current date in the new column**

In [42]:
data.head()

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238

In [43]:
data['today'] = pd.to_datetime(datetime.date.today())

In [44]:
data

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year,today
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238,2023-03-15
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238,2023-03-15
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238,2023-03-15
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238,2023-03-15
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238,2023-03-15
...,...,...,...,...,...,...,...,...,...
18283,18283,2014-09-25 19:00:00,868,9,September,Thursday,3,268,2023-03-15
18284,18284,2014-09-25 20:00:00,732,9,September,Thursday,3,268,2023-03-15
18285,18285,2014-09-25 21:00:00,702,9,September,Thursday,3,268,2023-03-15
18286,18286,2014-09-25 22:00:00,580,9,September,Thursday,3,268,2023-03-15
18287,18287,2014-09-25 23:00:00,534,9,September,Thursday,3,268,2023-03-15

In [45]:
difference_of_dates = data['today'] - data['Datetime']

In [46]:
difference_of_dates

0       3854 days 00:00:00
1       3853 days 23:00:00
2       3853 days 22:00:00
3       3853 days 21:00:00
4       3853 days 20:00:00
               ...
18283   3092 days 05:00:00
18284   3092 days 04:00:00
18285   3092 days 03:00:00
18286   3092 days 02:00:00
18287   3092 days 01:00:00
Length: 18288, dtype: timedelta64[ns]

In [47]:
difference_of_dates.apply(lambda x : x.days)

0        3854
1        3853
2        3853
3        3853
4        3853
         ...
18283    3092
18284    3092
18285    3092
18286    3092
18287    3092
Length: 18288, dtype: int64

In [48]:
data['day_difference'] = difference_of_dates.apply(lambda x : x.days)

In [49]:
data.head()

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year,today,day_difference
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238,2023-03-15,3854
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238,2023-03-15,3853
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238,2023-03-15,3853
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238,2023-03-15,3853
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238,2023-03-15,3853

## CHALLENGES WITH TIME DATA

**DEALING WITH TIME ZONES**
  - If you have the dataset of a specific timezone. You can tell pandas about the local time zone and later you can convert it into different time zones.
  - Use function dt.tz_localize to set the local time zone.

In [52]:
# set the current time as of asia
data['asia_timezone'] = data.Datetime.dt.tz_localize('Asia/Calcutta')

In [53]:
# view the data
data.head()

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year,today,day_difference,asia_timezone
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238,2023-03-15,3854,2012-08-25 00:00:00+05:30
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 01:00:00+05:30
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 02:00:00+05:30
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 03:00:00+05:30
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 04:00:00+05:30

- Use the column asia_timezone and convert it into UTC
- Use the function tz_convert to convert the time

In [54]:
# cahnge the asia time zone to UTC
data['utc_timezone'] = data.asia_timezone.dt.tz_convert('UTC')

In [57]:
data.head()

,ID,Datetime,Count,month,month_name,day_name,day_of_week,day_of_year,today,day_difference,asia_timezone,utc_timezone
0,0,2012-08-25 00:00:00,8,8,August,Saturday,5,238,2023-03-15,3854,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
1,1,2012-08-25 01:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 01:00:00+05:30,2012-08-24 19:30:00+00:00
2,2,2012-08-25 02:00:00,6,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 02:00:00+05:30,2012-08-24 20:30:00+00:00
3,3,2012-08-25 03:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 03:00:00+05:30,2012-08-24 21:30:00+00:00
4,4,2012-08-25 04:00:00,2,8,August,Saturday,5,238,2023-03-15,3853,2012-08-25 04:00:00+05:30,2012-08-24 22:30:00+00:00

In [56]:
data[['asia_timezone', 'utc_timezone']]

                  asia_timezone              utc_timezone
0     2012-08-25 00:00:00+05:30 2012-08-24 18:30:00+00:00
1     2012-08-25 01:00:00+05:30 2012-08-24 19:30:00+00:00
2     2012-08-25 02:00:00+05:30 2012-08-24 20:30:00+00:00
3     2012-08-25 03:00:00+05:30 2012-08-24 21:30:00+00:00
4     2012-08-25 04:00:00+05:30 2012-08-24 22:30:00+00:00
...                         ...                       ...
18283 2014-09-25 19:00:00+05:30 2014-09-25 13:30:00+00:00
18284 2014-09-25 20:00:00+05:30 2014-09-25 14:30:00+00:00
18285 2014-09-25 21:00:00+05:30 2014-09-25 15:30:00+00:00
18286 2014-09-25 22:00:00+05:30 2014-09-25 16:30:00+00:00
18287 2014-09-25 23:00:00+05:30 2014-09-25 17:30:00+00:00

[18288 rows x 2 columns]

## Select a random date

In [58]:
data['asia_timezone'][18287]

Timestamp('2014-09-25 23:00:00+0530', tz='Asia/Calcutta')

In [59]:
data['utc_timezone'][18287]

Timestamp('2014-09-25 17:30:00+0000', tz='UTC')

**You can see that time difference is 5 hours 30 minutes**

## READING DATA WITH UNIX TIMESTAMP.

- A UNIX timestamp is a way of storing a specific date and time. The timestamp is a ten digit number which represents the number of seconds that have passed since midnight on 1st January 1970, UTC time.

In [60]:
# read the data
data_with_unix_ts = pd.read_csv('datasets/data_with_timestamp.csv')

In [62]:
# view the data
data_with_unix_ts.head()

   ID   timestamp  Count
0   0  1345852800      8
1   1  1345856400      2
2   2  1345860000      6
3   3  1345863600      2
4   4  1345867200      2

In [63]:
# convert the unix timestamp to datetime.
data_with_unix_ts.timestamp = pd.to_datetime(data_with_unix_ts.timestamp, unit='s')

In [64]:
# view the top rows of data
data_with_unix_ts.head()

   ID           timestamp  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2